{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence listing required frontend video/photo asset behavior and documentation mapping.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/ASSET_SETUP.md": "Docs detailing required media filenames, upload-to-filename mapping, and behavior for missing assets.",
  "frontend/index.css": "Tailwind base/styles with OKLCH color variables and dark-mode theme settings.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root component rendering the BirthdayExperience.",
  "frontend/src/experience/BirthdayExperience.tsx": "Controls slide flow, start overlay, and background music coordination across the experience.",
  "frontend/src/experience/components/FireworksCanvas.tsx": "Canvas component rendering looping fireworks with particle animations.",
  "frontend/src/experience/components/HeartbeatPlayButton.tsx": "Clickable heart-shaped play button with pulse animation triggering video play.",
  "frontend/src/experience/components/PopupModal.tsx": "Popup modal showing photo messages with escape-close support.",
  "frontend/src/experience/components/PremiumBackground.tsx": "Animated background with glow circles and drifting balloons using canvas.",
  "frontend/src/experience/components/SlideShell.tsx": "Layout wrapper enforcing full-screen centered slide content.",
  "frontend/src/experience/components/StartOverlay.tsx": "Full-screen tap-to-start overlay shown before the experience begins.",
  "frontend/src/experience/hooks/useBackgroundMusic.ts": "Provides start, pause, and resume controls for looping background audio using refs.",
  "frontend/src/experience/hooks/useCountdown.ts": "Implements a countdown timer that triggers a callback when it reaches zero.",
  "frontend/src/experience/hooks/useSequentialReveal.ts": "Reveals items one by one on a timer and calls a completion callback after all are shown.",
  "frontend/src/experience/slides/Slide0Countdown.tsx": "Displays a 5‑second countdown before advancing to the next slide.",
  "frontend/src/experience/slides/Slide1Title.tsx": "Shows a birthday title sequence and reveals a button after a delay.",
  "frontend/src/experience/slides/Slide2Photos.tsx": "Shows four tappable photos that reveal messages; unlocks Next when all are clicked.",
  "frontend/src/experience/slides/Slide3Video.tsx": "Plays the first video with a custom play button and triggers start/end callbacks.",
  "frontend/src/experience/slides/Slide4Video.tsx": "Plays the second video similarly, with start/end event callbacks.",
  "frontend/src/experience/slides/Slide5Shayari.tsx": "Sequentially reveals shayari lines across two columns and shows a Next button when done.",
  "frontend/src/experience/slides/Slide6FinalSurprise.tsx": "Displays a button that advances to the final surprise slide.",
  "frontend/src/experience/slides/Slide7FinalMessage.tsx": "Shows the final heartfelt message with fireworks background.",
  "frontend/src/experience/types.ts": "Defines the SlideId union type for all slide identifiers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and identity persistence via context.",
  "frontend/src/index.css": "Defines Tailwind layers, color variables for light/dark themes, global styles, and several custom animations for breathing text, countdown, and title effects.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider, and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color variables, animations, typography/container plugins, and extended theme options.",
  "project_state.json": "Stores the project’s high-level requirements and architecture for a multi-slide interactive birthday web experience with strict media and layout rules."
}